---
kind: property
id: P:Autodesk.Revit.DB.ModelPath.Empty
source: html/d613467b-1030-6444-d4e4-0c6ae1ec76d3.htm
---
# Autodesk.Revit.DB.ModelPath.Empty Property

Whether this path is empty

## Syntax (C#)
```csharp
public bool Empty { get; }
```